#![allow(non_snake_case)]
#![allow(unused_parens)]
//-----------------------------------------------------------------------------------------------------------------------------------------
// actix_webは取り込むモジュールが異なるので各個呼び出し ※要検証
//-----------------------------------------------------------------------------------------------------------------------------------------
use actix_web::{HttpRequest, HttpResponse,ResponseError};
use thiserror::Error;

//-----------------------------------------------------------------------------------------------------------------------------------------
// COMMON モジュール(SEG4)
//-----------------------------------------------------------------------------------------------------------------------------------------
use crate::base::seg4_common;

//-----------------------------------------------------------------------------------------------------------------------------------------
// DB モジュール
//-----------------------------------------------------------------------------------------------------------------------------------------
use crate::base::db_base;

//-----------------------------------------------------------------------------------------------------------------------------------------
//  action_baseの読み込み
//-----------------------------------------------------------------------------------------------------------------------------------------
use crate::base::action_base;

//-----------------------------------------------------------------------------------------------------------------------------------------
// ResponseError のラッパー宣言。独自のエラー処理に使用
//-----------------------------------------------------------------------------------------------------------------------------------------
#[derive(Error, Debug)]
pub enum MyError {}
impl ResponseError for MyError {}

/*   ここから非共通部   */
//-----------------------------------------------------------------------------------------------------------------------------------------
//  business_logicの読み込み<アクション名>
//-----------------------------------------------------------------------------------------------------------------------------------------
pub use crate::business_logic::facs_test;

//-----------------------------------------------------------------------------------------------------------------------------------------
// 画面遷移別個別対応
// PathParam →Post 又は Get
//----------------------------------------------------------------------------------------------------------------------------------------
#[derive(seg4_common::Serialize, seg4_common::Deserialize)]
pub struct PostParam {
    _token: String,
    passwd : String,
    user_id : String,
}

//-----------------------------------------------------------------------------------------------------------------------------------------
// execute 処理開始
//-----------------------------------------------------------------------------------------------------------------------------------------
pub async fn execute(
    postForm: actix_web::web::Form<PostParam>,
    req: HttpRequest,
) -> Result<HttpResponse, MyError> {
    //-------------------------------------------------------------------------------------------------------------------------------------
    // ログイン必須ページかどうかをアクション別に設定。 true→誰でも見れる false→ログイン専用
    //-------------------------------------------------------------------------------------------------------------------------------------
    const GUEST_ACCESS_ALLOW: bool = true;

    //-------------------------------------------------------------------------------------------------------------------------------------
    // 多重登録禁止チェックかどうかをアクション別に設定。 true→必要 false→不要
    //-------------------------------------------------------------------------------------------------------------------------------------
    const UPDATE_EXISTS_ALLOW: bool = false;

/*   非共通部 ココマデ  */
    //-------------------------------------------------------------------------------------------------------------------------------------
    // 動的パスを変数化する
    //-------------------------------------------------------------------------------------------------------------------------------------
    

    //-------------------------------------------------------------------------------------------------------------------------------------
    // コントローラの先頭でDBインスタンスを確立
    //-------------------------------------------------------------------------------------------------------------------------------------
    let mut pg_client = db_base::db_connect();

    //-------------------------------------------------------------------------------------------------------------------------------------
    // サーバ関連の初期化。
    //-------------------------------------------------------------------------------------------------------------------------------------
    let server_info = action_base::ServerInfomation::set_server_infomation(req,&mut pg_client);

    //-------------------------------------------------------------------------------------------------------------------------------------
    // 不正アクセスのチェック。post_token_idが空の場合は NotFoundを返却
    //-------------------------------------------------------------------------------------------------------------------------------------
    if server_info.post_token_id == "" {
        //エラーログ
        seg4_common::info!("● Post UUID is Noting. {}",serde_json::to_string(&server_info).unwrap());
        return Ok(HttpResponse::NotFound()
        .header("Content-Type", seg4_common::HTTP_CONTENT_TYPE)
        .header("Cache-Control", seg4_common::HTTP_CACHE_CONTROL)
        .header("Set-Cookie", server_info.cookie_line)
        .body(seg4_common::NOTFOUND_ERROR))
    };

    //---------------------------------------------------------------------------------------------------------------------------------
    // ログイン中かどうかの判定(sessionはaction、ログインはbusinesslogicで管理)
    //---------------------------------------------------------------------------------------------------------------------------------
    if server_info.business_login_id < 1 && GUEST_ACCESS_ALLOW == false {
        if server_info.business_login_id == -1 {
            return Ok(HttpResponse::Unauthorized()
            .header("Content-Type", seg4_common::HTTP_CONTENT_TYPE)
            .header("Cache-Control", seg4_common::HTTP_CACHE_CONTROL)
            .header("Set-Cookie", server_info.cookie_line)
            .body(seg4_common::NO_LOGIN_ERROR))
        } else {
            //エラーログ
            seg4_common::info!("● Login Check Failed. {}",serde_json::to_string(&server_info).unwrap());
            return Ok(HttpResponse::InternalServerError()
            .header("Content-Type", seg4_common::HTTP_CONTENT_TYPE)
            .header("Cache-Control", seg4_common::HTTP_CACHE_CONTROL)
            .header("Set-Cookie", server_info.cookie_line)
            .body(seg4_common::FOTAL_ERROR))  
        };
    };
    
    //-------------------------------------------------------------------------------------------------------------------------------------
    //  フォームハンドラー関連の初期化
    //-------------------------------------------------------------------------------------------------------------------------------------
    //フォームハンドラーのデータクランプ
    let mut input_params = seg4_common::HashMap::new();
    //ヴァリテーションチェックの結果保持 (0:正常 5:バリテーションバック 9:ライズエクセプション)
    let mut input_result = seg4_common::HashMap::new();
    //ヴァリテーションバック詳細
    let mut valiback_detail = seg4_common::HashMap::new();

    //-------------------------------------------------------------------------------------------------------------------------------------
    // ステータスチェック 初期値 0→正常 5→バリバック 9→サーバエラー扱い
    //-------------------------------------------------------------------------------------------------------------------------------------
    input_result.insert(String::from("Result"), 0);

    /*   ここから非共通部   */

    //-------------------------------------------------------------------------------------------------------------------------------------
    // ハンドラをチェック関数を使って挿入する(_token) ※POSTでは必須
    //-------------------------------------------------------------------------------------------------------------------------------------
    let _token = &postForm._token;
    if &server_info.post_token_id != _token && server_info.reqest_method == "POST" {
        valiback_detail.insert("_token", "トークンが一致しません。");
        input_result.insert(String::from("Result"), 5);

    };
    let passwd = &postForm.passwd; //Postの場合
    input_params.insert(
        String::from(r"passwd"),
        action_base::InputParametars::set_input_parametars(
            true,//必須項目。必須ならtrue
            passwd.to_string(),//ハンドラ文字列
            true,//文字列で扱うなら true それ以外なら false
            r"英数字及び一部の記号のみ使用可能。".to_string(),//ヴァリテーションバック時のメッセージ文字列
            7,//最小値、文字列の場合は文字列数 -1で無視 
            17,//最大値、文字列の場合は文字列数 -1で無視
            r"^[A-Za-z0-9--_/*+.,!#$%&()~|]*$".to_string(),//正規表現チェック。境界値もこれで行う。全スルーは *
        ),
    );
    let user_id = &postForm.user_id; //Postの場合
    input_params.insert(
        String::from(r"user_id"),
        action_base::InputParametars::set_input_parametars(
            true,//必須項目。必須ならtrue
            user_id.to_string(),//ハンドラ文字列
            true,//文字列で扱うなら true それ以外なら false
            r"".to_string(),//ヴァリテーションバック時のメッセージ文字列
            -1,//最小値、文字列の場合は文字列数 -1で無視 
            -1,//最大値、文字列の場合は文字列数 -1で無視
            r"*".to_string(),//正規表現チェック。境界値もこれで行う。全スルーは *
        ),
    );

    //-------------------------------------------------------------------------------------------------------------------------------------
    // 入力チェック結果を集計
    //-------------------------------------------------------------------------------------------------------------------------------------
    for (key, value) in &input_params {
        if value.result == false {
            //詳細を追加
            valiback_detail.insert(key, &value.result_msg);
            //全体の戻り値を更新
            input_result.insert(String::from("Result"), 5);
        }
    }
    
    //-------------------------------------------------------------------------------------------------------------------------------------
    // ヴァリテーションがある場合は input_resultを組み立てて返却
    //-------------------------------------------------------------------------------------------------------------------------------------
    let &check_result = input_result.get(&String::from("Result")).unwrap();
    // ヴァリテーションの判定
    let json = 
    if check_result == 5 {
        //ヴァリテーションバックで終了
        format!("{{ \"result\": \"205 validation back\",\"valiback_detail\": {} }}", serde_json::to_string(&valiback_detail).unwrap())
    } else if server_info.query_string == "validation_only" {
        // QUERY_STRING指定でビジネスロジックを呼ばずに終了させる。
        String::from(seg4_common::VALIDATION_ALLOK)
    } else if UPDATE_EXISTS_ALLOW == true && server_info.is_exists_check== true {
        // 多重登録禁止チェック
        String::from(seg4_common::SAME_REQEST)    
    }else {
        //---------------------------------------------------------------------------------------------------------------------------------
        //ビジネスロジックの呼び出し
        //---------------------------------------------------------------------------------------------------------------------------------
        let business_logic = facs_test::BusinessLogic::execute(&server_info,&input_params,&mut pg_client);

        //---------------------------------------------------------------------------------------------------------------------------------
        // ビジネスロジック処理結果のチェック。5は権限付属、9はシステムエラー、それ以外は正常終了。
        //---------------------------------------------------------------------------------------------------------------------------------
        if business_logic.result == 5 {
            return Ok(HttpResponse::Unauthorized()
            .header("Content-Type", seg4_common::HTTP_CONTENT_TYPE)
            .header("Cache-Control", seg4_common::HTTP_CACHE_CONTROL)
            .header("Set-Cookie", server_info.cookie_line)
            .body(business_logic.data))
        } else if business_logic.result == 9 {
            //エラーログ
            seg4_common::info!("● BusinessLogic Error. {} {}",serde_json::to_string(&server_info).unwrap(),serde_json::to_string(&input_params).unwrap());
            return Ok(HttpResponse::InternalServerError()
            .header("Content-Type", seg4_common::HTTP_CONTENT_TYPE)
            .header("Cache-Control", seg4_common::HTTP_CACHE_CONTROL)
            .header("Set-Cookie", server_info.cookie_line)
            .body(business_logic.data))  
        }; 
        //最終出力 ※JSONは一気に変換せず、struct毎にformatで連結する。
        business_logic.data
    };

    //-------------------------------------------------------------------------------------------------------------------------------------
    //  正常終了時のJSON出力
    //-------------------------------------------------------------------------------------------------------------------------------------
    //デバッグが有効ならserver_infoをログ出力
    if server_info.is_debug == true  {
        seg4_common::info!("[server result] {}",serde_json::to_string(&server_info).unwrap());
    };
    Ok(HttpResponse::Ok()
    .header("Content-Type", seg4_common::HTTP_CONTENT_TYPE)
    .header("Cache-Control", seg4_common::HTTP_CACHE_CONTROL)
    .header("Set-Cookie", server_info.cookie_line)
    .body(json))

} //execute 終端

